# Дано три змінні дійсного типу: A, B, C. Якщо їх значення впорядковані за зростанням або зменшенням, то подвоїти їх;
# в іншому випадку замінити значення кожної змінної на протилежне. Вивести нові значення змінних A, B, C.

# не зрозумів що таке подвоїти, тому підвів кожне число ** 2

a, b, c = map(float, input("Введіть А, В, С: ").split())

if a < b and b < c:
    a = a * 2
    b = b * 2
    c = c * 2
else:
    a = -a
    b = -b
    c = -c

print("A = " + str(a) + ", B = " + str(b) + " C = " + str(c))
